import React from 'react';
import { Helmet } from 'react-helmet';
import CustomLink from '../../components/link/link';

export default function TermsOfUse () {

  return (
    <>
      <Helmet>
        <title>Reviewton - Умови використання</title>
      </Helmet>
      <div className='page-header'>
        <h1>Умови використання</h1>
      </div>
      <p className='justify'>
        Ці умови є юридичною угодою між Вами  (далі – Користувач) та reviewton-li40.onrender.com 
        (далі – &quot;<strong>Reviewton</strong>&quot;), і регулює використання вами <strong>Reviewton</strong>, 
        а також продуктів, функцій, додатків, технологій та програмного забезпечення, які ми 
        пропонуємо. Ці Умови використання застосовуються до веб-сайту reviewton-li40.onrender.com, 
        розташованому за адресою https://reviewton-li40.onrender.com
      </p>
      <h3 style={{textTransform: 'uppercase', textAlign: 'justify'}}>
        Перед переглядом цього сайту уважно прочитайте ці умови. Якщо ви не погоджуєтесь з цими 
        умовами, не використовуйте цей сайт.
      </h3>
      <h3><strong>Загальні положення</strong></h3>
      <ol>
        <li>Адміністрація сайту визначає правила поведінки на ньому та залишає за собою право 
          вимагати їх виконання від відвідувачів.</li>
        <li>Незнання правил не звільняє від необхідності виконання. Розміщення будь-якого 
          контенту (текст, фото) на сайті автоматично означає Вашу згоду з цими правилами 
          та з необхідністю їх дотримання.</li>
        <li>Адміністрація сайту не несе жодної відповідальності за збитки, понесені внаслідок 
          використання чи невикористання його інформації та сервісів.</li>
        <li>Ви приймаєте Умови за допомогою <strong>Reviewton</strong>, у разі незгоди Користувача 
          з будь-яким із положень Угоди, Користувач не має права використовувати <strong>Reviewton</strong> і 
          зобов&apos;язаний припинити використання сайту</li>
      </ol>
      <h3><strong>Використання сайту</strong></h3>
      <p className='justify'>
        <strong>Reviewton</strong> дозволяє вам переглядати контент лише для особистого 
        некомерційного використання, за умови збереження вами всієї інформації про авторське 
        право та інших відомостей про право власності, що містяться у вихідних матеріалах та 
        будь-яких їх копіях. Забороняється змінювати матеріали <strong>Reviewton</strong>, а також 
        розповсюджувати чи демонструвати їх у будь-якому вигляді або використовувати їх будь-яким 
        іншим чином для суспільних чи комерційних цілей. Будь-яке використання цих матеріалів 
        на інших сайтах або комп&apos;ютерних мережах забороняється.</p>
      <h3><strong>Правила розміщення відгуків та коментарів</strong></h3>
      <ol>
        <li>Забороняється розповсюджувати спам або розміщувати фіктивні відгуки з метою 
          підвищення або зниження рейтингу.</li>
        <li>Забороняється розміщувати або наводити посилання на зміст сексуального характеру.</li>
        <li>Забороняється розміщувати або наводити посилання на утримання злобного чи загрозливого характеру.</li>
        <li>Забороняється розміщувати або наводити посилання на пошкоджені файли, файли, що містять 
          віруси, &quot;троянських коней&quot; або інші шкідливі засоби, які можуть завдати шкоди 
          комп&apos;ютерам користувачів.</li>
        <li>Забороняється розміщувати будь-які матеріали, що порушують авторські або інші 
          права на інтелектуальну власність.</li>
        <li>Забороняється видавати себе за іншу особу чи фіктивно асоціювати себе з іншою особою чи організацією.</li>
        <li>Забороняється порушувати чинні закони та норми.</li>
        <li>Забороняється використовувати коментарі для рекламних цілей.</li>
      </ol>
      <p className='justify'>
        <strong>Reviewton</strong> залишає за собою право перевіряти та видаляти відгуки та коментарі, які 
        порушують вищезазначені умови.
      </p>
      <p className='justify'>
        Ми можемо видалити контент, який ви опублікували на <strong>Reviewton</strong>, щоб порушити ці 
        положення, і, якщо застосовно, можемо вжити заходів щодо вашого облікового запису з 
        причин, описаних нижче. Ми також можемо відключити ваш обліковий запис у разі систематичного 
        порушення прав на інтелектуальну власність інших людей.
      </p>
      <h3><strong>Відмова від відповідальності</strong></h3>
      <p className='justify'>
        Матеріали та послуги цього сайту надаються «як є» без будь-яких гарантій і призначені 
        лише для ознайомлення. <strong>Reviewton</strong> не гарантує точності та повноти 
        матеріалів, що надаються на цьому Сайті.
      </p>
      <p className='justify'>
        <strong>Reviewton</strong> у будь-який час без попередження може вносити зміни до 
        матеріалів та послуг, які надаються на <strong>Reviewton</strong>. У разі застаріння 
        матеріалів та послуг на <strong>Reviewton</strong> не зобов&apos;язується оновлювати їх. 
      </p>
      <p className='justify'>
        <strong>Reviewton</strong> за жодних обставин не несе відповідальності за будь-які 
        збитки, що виникли внаслідок використання, неможливості використання або результатів використання цього сайту. 
      </p>
      <p className='justify'>
        Ми не гарантуємо, не схвалюємо і не несемо відповідальності за будь-який продукт або 
        послугу, яка рекламується або пропонується користувачам через <strong>Reviewton</strong> або 
        за будь-яким гіперпосиланням на сайті. 
      </p>
      <p className='justify'>
        Ми не будемо жодним чином контролювати будь-які операції між Вами та сторонніми 
        постачальниками товарів чи послуг, фактична угода резервування та купівлі-продажу 
        полягає безпосередньо між продавцями та покупцями.
      </p>
      <p className='justify'>
        Адміністрація сайту не несе відповідальності за зміст рекламних матеріалів та інформаційних 
        статей, відгуків, коментарів та блогів користувачів, які розміщені на сторінках сайту, 
        а також за наслідки їх публікації та використання. 
      </p>
      <h3><strong>Використання та розкриття інформації</strong></h3>
      <p className='justify'>
        <strong>Reviewton</strong> може використовувати дані, зібрані за 
        допомогою <strong>Reviewton</strong> для поліпшення змісту <strong>Reviewton</strong>, для його 
        доопрацювання відповідно до переваг Користувачів <strong>Reviewton</strong>, для маркетингових 
        і дослідницьких цілей, і для будь-яких інших визначених цілей. 
        Крім того, <strong>Reviewton</strong> має право публікувати контент на сторонніх сервісах.
      </p>
      <h3><strong>Заключні положення</strong></h3>
      <p className='justify'>
        Діяльність адміністрації <strong>Reviewton</strong> здійснюється відповідно до 
        законодавства України. Будь-які претензії, суперечки, офіційні звернення 
        розглядатимуться виключно у порядку, передбаченому законодавством України.
      </p>
      <p className='justify'>
        Умови цієї Угоди можуть бути змінені адміністрацією сайту в односторонньому порядку. 
        Текст чинної Угоди доступний за адресою <CustomLink 
          href='https://reviewton-li40.onrender.com/terms-of-use' 
          text='https://reviewton-li40.onrender.com/terms-of-use' />
      </p>
    </> 
  );
}
