import React from 'react';
import { Helmet } from 'react-helmet';
import CustomLink from '../../components/link/link';

export default function PrivacyPolicy () {

  return (
    <>
      <Helmet>
        <title>Reviewton - Політика конфіденційності</title>
      </Helmet>
      <div className='page-header'>
        <h1>Політика конфіденційності</h1>
      </div>
      <p className='justify'>
        Ця Політика конфіденційності персональних даних (далі – Політика конфіденційності) 
        діє стосовно всієї інформації, яку сайт Reviewton, (далі – Сайт) 
        розташований на доменному імені reviewton-li40.onrender.com (а також його субдоменах), 
        може отримати про Користувача під час використання сайту reviewton-li40.onrender.com 
        (а також його субдоменів), його програм та його продуктів.
      </p>
      <h3><strong>1. Визначення термінів</strong></h3>
      <p className='justify'>
        1.1 У цій Політиці конфіденційності використовуються такі терміни:
      </p>
      <p className='justify'>
        1.1.1. «Адміністрація сайту» (далі – Адміністрація) – уповноважені співробітники на 
        управління сайтом Reviewton, які організують та (або) здійснюють обробку персональних 
        даних, а також визначає цілі обробки персональних даних, склад персональних даних, що 
        підлягають обробці, дії (операції), що здійснюються з персональними даними.
      </p>
      <p className='justify'>
        1.1.2. «Персональні дані» - будь-яка інформація, що відноситься до прямо або опосередковано 
        визначеної, або визначається фізичній особі (суб&apos;єкту персональних даних).
      </p>
      <p className='justify'>
        1.1.3. «Обробка персональних даних» - будь-яка дія (операція) або сукупність дій 
        (операцій), що здійснюються з використанням засобів автоматизації або без використання 
        таких засобів з персональними даними, включаючи збирання, запис, систематизацію, 
        накопичення, зберігання, уточнення (оновлення, зміна), вилучення, використання, 
        передачу ( поширення, надання, доступ), знеособлення, блокування, видалення, знищення персональних даних.
      </p>
      <p className='justify'>
        1.1.4. «Конфіденційність персональних даних» - обов&apos;язкова для дотримання Оператором 
        або іншою особою, яка отримала доступ до персональних даних, вимога не допускати їх 
        поширення без згоди суб&apos;єкта персональних даних або наявності іншої законної підстави.
      </p>
      <p className='justify'>
        1.1.5. «Сайт відгуків» - це сукупність пов&apos;язаних між собою веб-сторінок, розміщених у 
        мережі Інтернет за унікальною адресою (URL): reviewton-li40.onrender.com, а також його субдоменами.
      </p>
      <p className='justify'>
        1.1.6. «Субдомени» - це сторінки або сукупність сторінок, розташовані на доменах 
        третього рівня, що належать сайту Reviewton, а також інші тимчасові сторінки на яких 
        вказана контактна інформація Адміністрації
      </p>
      <p className='justify'>
        1.1.5. «Користувач Reviewton» (Далі Користувач) – особа, яка має доступ до сайту 
        Reviewton, через мережу Інтернет та використовує інформацію, матеріали та продукти сайту Reviewton.
      </p>
      <p className='justify'>
        1.1.7. «Cookies» — невеликий фрагмент даних, надісланий веб-сервером і зберігається на 
        комп&apos;ютері користувача, який веб-клієнт або веб-браузер щоразу пересилає веб-серверу 
        в HTTP-запиті під час спроби відкрити сторінку відповідного сайту.
      </p>
      <p className='justify'>
        1.1.8. «IP-адреса» — унікальна мережна адреса вузла в комп&apos;ютерній мережі, через яку 
        Користувач отримує доступ на Сайт.
      </p>
      <h3><strong>2. Загальні положення</strong></h3>
      <p className='justify'>
        2.1. Використання сайту Reviewton Користувачем означає згоду з цією Політикою конфіденційності 
        та умовами обробки персональних даних Користувача.
      </p>
      <p className='justify'>
        2.2. У разі незгоди з умовами Політики конфіденційності, Користувач повинен припинити 
        використання сайту Reviewton.
      </p>
      <p className='justify'>
        2.3. Ця Політика конфіденційності застосовується до сайту Reviewton. Сайт не контролює 
        та не несе відповідальності за сайти третіх осіб, на які Користувач може перейти за 
        посиланнями, доступними на сайті Reviewton.
      </p>
      <p className='justify'>
        2.4. Адміністрація не перевіряє достовірність персональних даних, які надає Користувач.
      </p>
      <h3><strong>3. Предмет політики конфіденційності</strong></h3>
      <p className='justify'>
        3.1. Ця Політика конфіденційності встановлює зобов&apos;язання Адміністрації щодо нерозголошення 
        та забезпечення режиму захисту конфіденційності персональних даних, які Користувач надає на 
        запит Адміністрації при реєстрації на сайті Reviewton.
      </p>
      <p className='justify'>
        3.2. Персональні дані, дозволені для обробки в рамках цієї Політики конфіденційності, 
        надаються Користувачем шляхом заповнення форм на сайті Reviewton і включають таку інформацію:
      </p>
      <ul>
        <li>адреса електронної пошти (e-mail)</li>
      </ul>
      <p className='justify'>
        3.3. Сайт захищає Дані, які автоматично передаються при відвідуванні сторінок:
      </p>
      <ul>
        <li>IP адреса</li>
        <li>інформація з cookies</li>
        <li>інформація про браузер</li>
        <li>час доступу</li>
        <li>реферер (адреса попередньої сторінки)</li>
      </ul>
      <p className='justify second-level'>
        3.3.1. Відключення cookies може спричинити неможливість доступу до частин сайту, які потребують авторизації.
      </p>
      <p className='justify second-level'>
        3.3.2. Сайт здійснює збір статистики про IP-адреси своїх відвідувачів. Ця інформація 
        використовується з метою запобігання, виявлення та вирішення технічних проблем.
      </p>
      <p className='justify'>
        3.4. Будь-яка інша персональна інформація не обумовлена вище (історія відвідування, браузери, 
        операційні системи тощо) підлягає надійному зберіганню та нерозповсюдженню, за винятком 
        випадків, передбачених у п.п. 5.2. цієї Політики конфіденційності.
      </p>
      <p className='justify'>
        3.5. Сторонні постачальники, у тому числі Google, використовують файли cookie для 
        показу оголошень з урахуванням попередніх відвідувань користувача.
      </p>
      <p className='justify'>
        3.6. Файли cookie рекламних переваг дозволяють рекламним мережам, у тому числі компанії 
        Google та її партнерам, показувати оголошення з урахуванням відвідувань Reviewton 
        та/або інших сайтів користувачем.
      </p>
      <h3><strong>4. Цілі збору персональної інформації користувача</strong></h3>
      <p className='justify'>
        4.1. Персональні дані Користувача Адміністрація може використовуватись з метою:
      </p>
      <p className='justify second-level'>
        4.1.1. Ідентифікації Користувача, зареєстрованого на сайті Reviewton для його подальшої авторизації.
      </p>
      <p className='justify second-level'>
        4.1.2. Надання Користувачеві доступу до персональних даних сайту Reviewton.
      </p>
      <p className='justify second-level'>
        4.1.3. Встановлення з Користувачем зворотного зв&apos;язку, включаючи направлення повідомлень, 
        запитів щодо використання сайту otzyvua.net, обробки запитів та заявок від Користувача.
      </p>
      <p className='justify second-level'>
        4.1.4. Визначення місця знаходження Користувача для забезпечення безпеки, запобігання шахрайству.
      </p>
      <p className='justify second-level'>
        4.1.5. Підтвердження достовірності та повноти персональних даних, наданих Користувачем.
      </p>
      <p className='justify second-level'>
        4.1.6. Створення облікового запису для використання частин сайту Reviewton, якщо Користувач погодився 
        на створення облікового запису.
      </p>
      <p className='justify second-level'>
        4.1.7. Повідомлення Користувача електронною поштою.
      </p>
      <p className='justify second-level'>
        4.1.8. Надання Користувачеві ефективної технічної підтримки у разі виникнення проблем, 
        пов&apos;язаних з використанням сайту Reviewton.
      </p>
      <h3><strong>5. Способи та терміни обробки персональної інформації</strong></h3>
      <p className='justify'>
        5.1. Обробка персональних даних Користувача здійснюється без обмеження терміну будь-яким 
        законним способом, у тому числі в інформаційних системах персональних даних з використанням 
        засобів автоматизації або без використання таких засобів.
      </p>
      <p className='justify'>
        5.2. Персональні дані Користувача можуть бути передані уповноваженим органам державної 
        влади тільки на підставах та в порядку, встановлених чинним законодавством.
      </p>
      <p className='justify'>
        5.3. У разі втрати або розголошення персональних даних Адміністрація має право не інформувати 
        Користувача про втрату або розголошення персональних даних.
      </p>
      <p className='justify'>
        5.4. Адміністрація вживає необхідних організаційних та технічних заходів для захисту 
        персональної інформації Користувача від неправомірного або випадкового доступу, знищення, 
        зміни, блокування, копіювання, розповсюдження, а також від інших неправомірних дій третіх осіб.
      </p>
      <p className='justify'>
        5.5. Адміністрація спільно з Користувачем вживає всіх необхідних заходів щодо запобігання 
        збиткам або іншим негативним наслідкам, викликаним втратою або розголошенням персональних даних Користувача.
      </p>
      <p className='justify'>
        5.6. Ви маєте право на:
      </p>
      <p className='justify second-level'>
        5.6.1. Запит на видалення персональних даних.
      </p>
      <p className='justify second-level'>
        5.6.2. Якщо ви вважаєте, що ваші права та інтереси були порушені, ви можете пред&apos;явити 
        претензію. Ми зробимо все можливе, щоби виправити ситуацію. Для цього, будь ласка, 
        надішліть нам email на пошту: reviewton.site@gmail.com.
      </p>
      <h3><strong>6. Права та обов&apos;язки сторін</strong></h3>
      <p className='justify'>
        <strong>6.1. Користувач має право:</strong>
      </p>
      <p className='justify second-level'>
        6.1.1. Приймати вільне рішення про надання своїх персональних даних, необхідних для використання 
        сайту reviewton-li40.onrender.com, та давати згоду на їх обробку.
      </p>
      <p className='justify second-level'>
        6.1.3. Користувач має право на отримання в Адміністрації інформації щодо обробки його 
        персональних даних, якщо таке право не обмежене відповідно до федеральних законів. 
        Користувач має право вимагати від Адміністрації уточнення його персональних даних, 
        їхнього блокування або знищення у разі, якщо персональні дані є неповними, застарілими, 
        неточними, незаконно отриманими або не є необхідними для заявленої мети обробки, а 
        також вживати передбачених законом заходів щодо захисту своїх прав. Для цього достатньо 
        повідомити Адміністрацію за вказаною електронною поштою адресою.
      </p>
      <p className='justify'>
        <strong>6.2. Адміністрація зобов&apos;язана:</strong>
      </p>
      <p className='justify second-level'>
        6.2.1. Використовувати отриману інформацію виключно для цілей, зазначених у п. 4 цієї Політики конфіденційності.
      </p>
      <p className='justify second-level'>
        6.2.2. Забезпечити зберігання конфіденційної інформації в таємниці, не розголошувати без 
        попереднього письмового дозволу Користувача, а також не здійснювати продаж, обмін, 
        опублікування чи розголошення іншими можливими способами переданих персональних даних 
        Користувача, за винятком п.п. 5.2. цієї Політики Конфіденційності.
      </p>
      <p className='justify second-level'>
        6.2.3. Вживати запобіжних заходів для захисту конфіденційності персональних даних 
        Користувача згідно з порядком, який зазвичай використовується для захисту такого роду 
        інформації в існуючому діловому обороті.
      </p>
      <p className='justify second-level'>
        6.2.4. Здійснити блокування персональних даних, що належать до відповідного Користувача, 
        з моменту звернення або запиту Користувача або його законного представника або уповноваженого 
        органу захисту прав суб&apos;єктів персональних даних на період перевірки у разі виявлення 
        недостовірних персональних даних або неправомірних дій.
      </p>
      <h3><strong>7. Відповідальність сторін</strong></h3>
      <p className='justify'>
        7.1. У разі втрати або розголошення Конфіденційної інформації Адміністрація не несе 
        відповідальності, якщо ця конфіденційна інформація:
      </p>
      <p className='justify second-level'>
        7.1.1. Стала громадським надбанням до її втрати чи розголошення.
      </p>
      <p className='justify second-level'>
        7.1.2. Була отримана від третьої сторони до її отримання Адміністрацією Ресурсу.
      </p>
      <p className='justify second-level'>
        7.1.3. Була розголошена за згодою Користувача.
      </p>
      <p className='justify'>
        7.2. Користувач несе повну відповідальність за дотримання вимог чинного законодавства, 
        у тому числі законів про рекламу, про захист авторських та суміжних прав, про охорону 
        товарних знаків та знаків обслуговування, але не обмежуючись перерахованим, включаючи 
        повну відповідальність за зміст та форму матеріалів.
      </p>
      <p className='justify'>
        7.3. Користувач визнає, що відповідальність за будь-яку інформацію (у тому числі, але 
        не обмежуючись: файли з даними, тексти тощо), до якої він може мати доступ як до частини 
        сайту Reviewton, несе особа, яка надала таку інформацію.
      </p>
      <p className='justify'>
        7.4. Користувач погоджується, що інформація, надана йому як частина сайту reviewton-li40.onrender.com, 
        може бути об&apos;єктом інтелектуальної власності, права на який захищені та належать іншим 
        Користувачам, партнерам або рекламодавцям, які розміщують таку інформацію на сайті reviewton-li40.onrender.com.
      </p>
      <p className='justify'>
        Користувач не має права вносити зміни, передавати в оренду, передавати на умовах позики, 
        продавати, розповсюджувати або створювати похідні роботи на основі такого Змісту (повністю 
        або в частині), за винятком випадків, коли такі дії були письмово прямо дозволені 
        власниками такого Змісту відповідно до умовами окремої угоди.
      </p>
      <p className='justify'>
        7.5. Стосовно текстових матеріалів (статей, публікацій, що знаходяться у вільному публічному 
        доступі на сайті reviewton-li40.onrender.com) допускається їх поширення за умови, що буде 
        дане посилання на Сайт.
      </p>
      <p className='justify'>
        7.6. Адміністрація не несе відповідальності перед Користувачем за будь-які збитки або 
        збитки, завдані Користувачем внаслідок видалення, збою або неможливості збереження 
        будь-якого Змісту та інших комунікаційних даних, що містяться на сайті reviewton-li40.onrender.com 
        або передаються через нього.
      </p>
      <p className='justify'>
        7.7. Адміністрація не несе відповідальності за будь-які прямі чи непрямі збитки, що 
        відбулися через: використання або неможливість використання сайту або окремих сервісів; 
        несанкціонованого доступу до комунікацій Користувача; заяви чи поведінка будь-якої третьої особи на сайті.
      </p>
      <p className='justify'>
        7.8. Адміністрація не несе відповідальності за будь-яку інформацію, розміщену 
        користувачем на сайті reviewton-li40.onrender.com, включаючи, але не обмежуючись: 
        інформацію, захищену авторським правом, без прямої згоди власника авторського права.
      </p>
      <h3><strong>8. Вирішення спорів</strong></h3>
      <p className='justify'>
        8.1. До звернення до суду із позовом щодо спорів, що виникають із відносин між Користувачем 
        та Адміністрацією, обов&apos;язковим є пред&apos;явлення претензії (письмової пропозиції чи пропозиції 
        в електронному вигляді про добровільне врегулювання спору).
      </p>
      <p className='justify'>
        8.2. Одержувач претензії протягом 30 календарних днів з дня отримання претензії письмово 
        або в електронному вигляді повідомляє заявника претензії про результати розгляду претензії.
      </p>
      <p className='justify'>
        8.3. При недосягненні угоди спір буде передано на розгляд Арбітражного суду.
      </p>
      <p className='justify'>
        8.4. До цієї Політики конфіденційності та відносин між Користувачем та Адміністрацією 
        застосовується чинне законодавство.
      </p>
      <h3><strong>9. Додаткові умови</strong></h3>
      <p className='justify'>
        9.1. Адміністрація має право вносити зміни до цієї Політики конфіденційності без згоди Користувача.
      </p>
      <p className='justify'>
        9.2. Нова Політика конфіденційності набирає чинності з моменту її розміщення на сайті 
        reviewton-li40.onrender.com, якщо інше не передбачено новою редакцією Політики конфіденційності.
      </p>
      <p className='justify'>
        9.3. Усі пропозиції чи питання щодо цієї Політики конфіденційності слід повідомляти за адресою: 
        reviewton.site@gmail.com
      </p>
      <p className='justify'>
        9.4. Діюча Політика конфіденційності розміщена на сторінці за адресою 
        &nbsp;<CustomLink
          href='https://reviewton-li40.onrender.com/privacy-policy' 
          text='https://reviewton-li40.onrender.com/privacy-policy' />
      </p>
    </>
  );
}
